<?php
/**
 *   +----------------------------------------------------------------------
 *   | PROJECT:   [ ethereum-php ]
 *   +----------------------------------------------------------------------
 *   | 官方网站:   [ https://developer.kaadon.com ]
 *   +----------------------------------------------------------------------
 *   | Author:    [ kaadon.com <kaadon.com@gmail.com>]
 *   +----------------------------------------------------------------------
 *   | Tool:      [ PhpStorm ]
 *   +----------------------------------------------------------------------
 *   | Date:      [ 2025/3/5 ]
 *   +----------------------------------------------------------------------
 *   | 版权所有    [ 2020~2025 kaadon.com ]
 *   +----------------------------------------------------------------------
 **/

use Kaadon\Ethereum\RPC\Infura;

require_once __DIR__ . "/vendor/autoload.php";

$infura  = new Infura('bd1d5e46f6254429a11ac3bf6857e1f4','l6EfGJmXBMb1ARNAGqxWjhBlsTZpFfU0/DWPfZy5x42Z1pLf7MExDA','mainnet');
$gasFees = $infura->getSuggestedGasFees(1);
var_dump();